# Дан текстовый файл, каждая строка которого содержит
# изображения нескольких чисел, разделенные пробелами (вещественные числа
# имеют ненулевую дробную часть). Создать файл вещественных чисел, содержащий (в том же порядке) все числа из исходного файла, имеющие ненулевую
# дробную часть.

inp = open(r"Labs/10 (Работа с файлами в PYTHON)/Files/4Input.txt", 'r')
out = open(r"Labs/10 (Работа с файлами в PYTHON)/Files/4Output.txt", 'w')

nums = inp.read().split()

for num in nums:
    if not num.isdigit():
        out.write(f"{num} ")

inp.close()
out.close()