# Дан символ C — прописная (заглавная) русская буква и текстовый
# файл. Создать строковый файл и записать в него все слова из исходного файла,
# начинающиеся на эту букву (прописную или строчную). Словом считать набор
# символов, не содержащий пробелов, знаков препинания и ограниченный
# пробелами, знаками препинания или началом/концом строки. Если исходный
# файл не содержит подходящих слов, то оставить результирующий файл
# пустым.


import re

C = input("Symbol: ").lower()
inp = open(r"Labs/10 (Работа с файлами в PYTHON)/Files/3Input.txt", 'r')
out = open(r"Labs/10 (Работа с файлами в PYTHON)/Files/3Output.txt", 'w')

words = re.findall(r"\w+", inp.read())
for w in words:
    if w.lower()[0] == C:
        out.write(w + " ")

inp.close()
out.close()
