# Дан массив действительных чисел А(N), значения элементов
# которого лежат в диапазоне [a,b]. Отсортировать по невозрастанию элементы
# массива, находящиеся между первым и последним элементами, в которых
# первой цифрой после запятой является 8. Использовать алгоритм сортировки
# выбором.

from random import randint
N = 10
arr = []
for i in range(N):
    arr.append(randint(-100, 100))
print(arr)

i = 0
while i < N - 1:
    m = i
    j = i + 1
    while j < N:
        if arr[j] < arr[m]:
            m = j
        j += 1
    arr[i], arr[m] = arr[m], arr[i]
    i += 1

print(arr)