#Дан список продуктов, найти все продукты, начинающиеся на 1 заданную букву
products = [                                                                                                                                                                                   
    "Молоко",
    "Яйца",
    "Хлеб",
    "Масло",
    "Сахар",
    "Соль",
    "Мука",
    "Рис",
    "Макароны",
    "Картофель",
    "Морковь",
    "Лук",
    "Чеснок",
    "Помидоры",
    "Огурцы",
    "Перец",
    "Капуста",
    "Яблоки",
    "Бананы",
    "Апельсины",
    "Груши",
    "Виноград",
    "Клубника",
    "Малина",
    "Арбуз",
    "Дыня",
    "Сливы",
    "Абрикосы",
    "Персики",
    "Чай",
    "Кофе",
    "Сок",
    "Вода",
    "Газировка",
    "Пиво",
    "Вино",
    "Водка",
    "Рыба",
    "Мясо",
    "Курица",
    "Свинина",
    "Говядина",
    "Колбаса",
    "Сыр",
    "Творог",
    "Сметана",
    "Йогурт",
    "Майонез",
    "Кетчуп",
    "Горчица"
    "Мед",
    "Соус",
    "Специи"
]
bukva = input("Буква: ")
matches = [i for i in products if i[0] == bukva]
print(matches)